// let a = +prompt('Введіть код, ви маєте 4 спроби');

// let i = 4;
// if (a == '1111' && i != 0) {
//     document.write('Запрошуємо на сайт')
// }
// for (a!='1111',i != 0,i--){
//     if (a != '1111') {

//         document.write(`У вас залишилось ${i} спроби`)
//     } else {
//         alert('Будь ласка спробуйте пізніше!')
//     }


// let i = 5;
// for (i != 0, i--) {
//     let a = +prompt(`Введіть код, ви маєте ${i} спроби`)
//     if (a == '1111'){
//         alert('Запрошуємо на сайт')
//     }
//     else if( a != '1111')
// }
let b;
for (i = 4; i > 0; i--) {
    let a = +prompt(`Введіть код, ви маєте ${i} спроби`);
    if (a == '1111') {
        b = true;
        i = -1;
    }
}
if (b == true) {
    document.write('Запрошуємо на сайт');
}
if (i == 0) {
    alert('Будь ласка спробуйте пізніше!');
}